Tekla Open API Reference for Tekla Structures 2025
DrawingEnumeratorBase Properties
The DrawingEnumeratorBase type exposes the following members.
Properties
Name | Description
AutoFetch
 Indicates that the objects are fetched from the drawing when the enumerator is created. Object information is therefore not anymore fetched when 'Current' item is asked from the enumerator. Property value is used for all enumerators in application
Top
See Also
Reference
DrawingEnumeratorBase Class
Tekla.Structures.Drawing Namespace